# GridLines

## Description
Procedure GridLines sets the distance between the drawing grid lines in the document.

```pascal
PROCEDURE GridLines(gridDistance : REAL);
```

```python
def vs.GridLines(gridDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|gridDistance|REAL|Grid spacing distance.|

## Version
Availability: from All Versions

## Category
* Document Settings